app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (login = 'usuario') OR 1--) ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def show
    payload = params[:login]

    @user = User.where("login = '#{payload}'").to_a

SELECT "users".* FROM "users" WHERE (login = '') OR 1=1--) ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "users" ("login", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["login", "usuario"], ["password", "password"], ["created_at", "2019-11-20 22:23:00.532475"], ["updated_at", "2019-11-20 22:23:00.532475"]]
INSERT INTO "users" ("login", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["login", "usuario"], ["password", "senha"], ["created_at", "2019-11-20 22:22:44.232040"], ["updated_at", "2019-11-20 22:22:44.232040"]]
---
  def create
    xml = params[:xml]
    p '-------------'
    Hash.from_xml(xml)["users"].each do |elem|
      if elem.second.kind_of?(Array)
        elem.second.each do |user|
          p 'Novo Usuario:'
          p 'Login: ' + user['login']
          p 'Senha: ' + user['password']
          p '-------------'
          User.create!(login: user['login'], password: user['password'])
        end
      else
        p 'Novo Usuario:'
        p 'Login: ' + elem.second['login']
        p 'Senha: ' + elem.second['password']
        p '-------------'
        User.create!(login: elem.second['login'], password: elem.second['password'])